temp1/src/Catalogs/ТемыОбсуждений/ТемыОбсуждений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТемыОбсуждений</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Документ</name>
    <type>
      <types>CatalogRef.Заказчики</types>
      <types>DocumentRef.Задачи</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрытая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиФорума</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

temp1/src/Catalogs/ПапкиФорума/ПапкиФорума.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПапкиФорума</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ТемыДокументов</name>
      <description>Предметные темы</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <comment>Описание раздела</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за раздел</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <comment>Дата создания раздела</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

temp1/src/Catalogs/СообщенияОбсуждений/СообщенияОбсуждений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СообщенияОбсуждений</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецСообщения</name>
    <type>
      <types>CatalogRef.ТемыОбсуждений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВопросГолосования</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленоГолосование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервоеСообщениеТемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщенияСписок</name>
    <comment>Текст сообщения для отображения в динамическом списке</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СокращенТекстСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВариантыГолосования</name>
    <attributes>
      <name>ТекстВарианта</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

temp1/src/Catalogs/ТемыОбсуждений/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		Автор = ПользователиКлиентСервер.ТекущийПользователь();
		Если ДанныеЗаполнения <> Неопределено И ДанныеЗаполнения.Свойство("Документ") Тогда
			Документ = ДанныеЗаполнения.Документ;
			ТемаДокумента = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка
		И ЗначениеЗаполнено(ОбменДанными.Отправитель) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Папка) Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Не указан раздел темы'");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Документ) И Папка <> Справочники.ПапкиФорума.ТемыДокументов Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Темы документов могут располагаться только в разделе тем документов'");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Документ) И Папка = Справочники.ПапкиФорума.ТемыДокументов Тогда
		Отказ = Истина;
		ВызватьИсключение НСтр("ru = 'Общие темы не могут располагаться в разделе тем документов'");
	КонецЕсли;
	
	Если ЭтоНовый() Тогда 
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	ДополнительныеСвойства.Вставить("ПометкаНовый", ЭтоНовый());
	
	Если НЕ ЗначениеЗаполнено(Документ) Тогда
		// Обработка рабочей группы
		СсылкаОбъекта = Ссылка;
		// Установка ссылки нового
		Если Не ЗначениеЗаполнено(СсылкаОбъекта) Тогда
			СсылкаОбъекта = ПолучитьСсылкуНового();
			Если Не ЗначениеЗаполнено(СсылкаОбъекта) Тогда
				СсылкаНового = Справочники.ТемыОбсуждений.ПолучитьСсылку();
				УстановитьСсылкуНового(СсылкаНового);
				СсылкаОбъекта = СсылкаНового;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверка изменения пометки удаления.
	ПредыдущаяПометкаУдаления = Ложь;
	Если Не Ссылка.Пустая() Тогда
		ПредыдущаяПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления");
	КонецЕсли;
	ДополнительныеСвойства.Вставить("ПредыдущаяПометкаУдаления", ПредыдущаяПометкаУдаления);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка
		И ЗначениеЗаполнено(ОбменДанными.Отправитель) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ПредыдущаяПометкаУдаления")
			И ДополнительныеСвойства.Свойство("ПометкаНовый")
			И ПометкаУдаления <> ДополнительныеСвойства.ПредыдущаяПометкаУдаления 
			И Не ДополнительныеСвойства.ПометкаНовый Тогда
			
		// Отбираем сообщения и пытаемся поставить им пометку удаления
		УстановитьПривилегированныйРежим(Истина);
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	СообщенияОбсуждений.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.СообщенияОбсуждений КАК СообщенияОбсуждений
			|ГДЕ
			|	СообщенияОбсуждений.ВладелецСообщения = &ВладелецСообщения";	
		Запрос.УстановитьПараметр("ВладелецСообщения", Ссылка);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Сообщение = Выборка.Ссылка.ПолучитьОбъект();
			
			Попытка
				
				Сообщение.Заблокировать();
				Сообщение.УстановитьПометкуУдаления(ПометкаУдаления);
				
			Исключение
				
				// Вызывается при удалении первого сообщения темы.
				Инфо = ИнформацияОбОшибке();

				Если Инфо.Описание = "Ошибка при вызове метода контекста (Заблокировать)" Тогда
					
					Если Не Сообщение.ПервоеСообщениеТемы Тогда
						
						Отказ = Истина;
						ВызватьИсключение;
						
					КонецЕсли;
					
				Иначе
					
					ВызватьИсключение;
					
				КонецЕсли;
				
			КонецПопытки;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
